app/Models/Admin/Menu.php

select * from `menu` where exists (select * from `rol` inner join `menu_rol` on `rol`.`id` = `menu_rol`.`rol_id` where `menu`.`id` = `menu_rol`.`menu_id` and `rol_id` is null order by `menu_id` asc) order by `menu_id` asc, `orden` asc
---
    public function getPadres($front)
    {
        if ($front) {
            return $this->whereHas('roles', function ($query) {

                $query->where('rol_id', session()->get('rol_id'))->orderby('menu_id');

            })->orderby('menu_id')
                ->orderby('orden')
                ->get()
                ->toArray();