app/Http/Controllers/Guest/LibroController.php

    public function index()
    {
        //
        // dd(auth()->user());
        // dd(session()->all());

        // dd(cache()->get('Permiso.rolid.2'));
        // dd(auth()->user());
        can('listar-libros');

        $libros = Libro::orderBy('id')->get();
---
select * from `libro` order by `id` asc

    public function update(ValidacionLibro $request, Libro $libro)
    {
        if($foto = Libro::setCaratula($request->foto_up,$libro->foto))
            $request->request->add(['foto' => $foto]);

        $libro->update($request->all());
---
update `libro` set `foto` = 'bbFJngcU8bNxuQZ4g6aX.jpg', `libro`.`updated_at` = '2019-10-17 23:40:19' where `id` = 1

    public function destroy($id,Request $request)
    {
        //
        if($request->ajax()){

            $libro = Libro::findOrFail($id);
            if($libro->destroy($id)){
                Storage::disk('public')->delete("imagenes/caratulas/{$libro->foto}");
---
select * from `libro` where `id` in ('2')
delete from `libro` where `id` = 2